---
kind: method
id: M:Autodesk.Revit.DB.Profile.Clone
source: html/6781808a-62fb-2db8-9d63-8fd500f89ebf.htm
---
# Autodesk.Revit.DB.Profile.Clone Method

Returns a copy of this profile.

## Syntax (C#)
```csharp
public Profile Clone()
```